app/views/pages/home.html.erb

SELECT "tournaments".* FROM "tournaments" WHERE "tournaments"."user_id" = ?  [["user_id", 2]]
---
				<table class="table table-striped">
					<% current_user.tournaments.each do |t| %>