app/controllers/pages_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "Joe"]]
---
  def home
    # grab the username from the URL as :id
    if (User.find_by_username(params[:id]))