app/controllers/tournaments_controller.rb

  def create
    @tournament = Tournament.new(user_params)
    if @tournament.save
---
INSERT INTO "tournaments" ("name", "age", "weapon", "team", "date", "sex", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["name", "Poop House"], ["age", ""], ["weapon", ""], ["team", "f"], ["date", "2016-08-05"], ["sex", ""], ["created_at", "2016-09-01 01:34:33.834858"], ["updated_at", "2016-09-01 01:34:33.834858"]]

  def edit
    @tournament = Tournament.find(params[:id])
---
SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = ? LIMIT 1  [["id", 1]]

  def reg
    @tournament = Tournament.find(params[:id])
---
SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @tournament = Tournament.find(params[:id])
    if @tournament.update_attributes(user_params)
---
SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "tournaments" SET "name" = ?, "updated_at" = ? WHERE "tournaments"."id" = ?  [["name", "Testing Partial (after edit)"], ["updated_at", "2016-09-01 01:42:30.430491"], ["id", 6]]

  def show
    @tournament = Tournament.find(params[:id])
---
SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = ? LIMIT 1  [["id", 3]]